RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_gpio.c
/******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 */
/******************************************************************************/
/** \file hc32f460_gpio.c
 **
 ** A detailed description is available at
 ** @link GpioGroup Gpio description @endlink
 **
 **   - 2018-10-12 CDT First version for Device Driver Library of Gpio.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f460_gpio.h"
#include "hc32f460_utility.h"

#if (DDL_GPIO_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup GpioGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
#define GPIO_BASE       (0x40053800ul)
#define PODR_BASE       (0x0004ul)
#define POER_BASE       (0x0006ul)
#define POSR_BASE       (0x0008ul)
#define PORR_BASE       (0x000Aul)
#define PCR_BASE        (0x0400ul)
#define PFSR_BASE       (0x0402ul)

/*! Parameter validity check for port group. */
#define IS_VALID_PORT(x)                                                        \
(   ((x) == PortA)                              ||                              \
    ((x) == PortB)                              ||                              \
    ((x) == PortC)                              ||                              \
    ((x) == PortD)                              ||                              \
    ((x) == PortE)                              ||                              \
    ((x) == PortH))

/*! Parameter validity check for pin. */
#define IS_VALID_PIN(x)                                                         \
(   ((x) == Pin00)                              ||                              \
    ((x) == Pin01)                              ||                              \
    ((x) == Pin02)                              ||                              \
    ((x) == Pin03)                              ||                              \
    ((x) == Pin04)                              ||                              \
    ((x) == Pin05)                              ||                              \
    ((x) == Pin06)                              ||                              \
    ((x) == Pin07)                              ||                              \
    ((x) == Pin08)                              ||                              \
    ((x) == Pin09)                              ||                              \
    ((x) == Pin10)                              ||                              \
    ((x) == Pin11)                              ||                              \
    ((x) == Pin12)                              ||                              \
    ((x) == Pin13)                              ||                              \
    ((x) == Pin14)                              ||                              \
    ((x) == Pin15))

/*! Parameter validity check for debug pins. */
#define IS_VALID_DEBUGPIN(x)                    ((x) <= 0x1Fu)

/*! Parameter validity check for pin mode. */
#define IS_VALID_PINMODE(x)                                                     \
(   ((x) == Pin_Mode_In)                        ||                              \
    ((x) == Pin_Mode_Out)                       ||                              \
    ((x) == Pin_Mode_Ana))

/*! Parameter validity check for pin drive capacity. */
#define IS_VALID_PINDRV(x)                                                      \
(   ((x) == Pin_Drv_L)                          ||                              \
    ((x) == Pin_Drv_M)                          ||                              \
    ((x) == Pin_Drv_H))

/*! Parameter validity check for pin output type. */
#define IS_VALID_PINTYPE(x)                                                     \
(   ((x) == Pin_OType_Cmos)                     ||                              \
    ((x) == Pin_OType_Od))

/*! Parameter validity check for pin read wait cycle. */
#define IS_VALID_READWAIT(x)                                                    \
(   ((x) == WaitCycle0)                         ||                              \
    ((x) == WaitCycle1)                         ||                              \
    ((x) == WaitCycle2)                         ||                              \
    ((x) == WaitCycle3))

/*! Parameter validity check for pin function */
#define IS_VALID_FUNC(x)                                                        \
(   ((x) == Func_Gpio)                          ||                              \
    (((x) >= Func_Fcmref)                       &&                              \
    ((x) <= Func_I2s))                          ||                              \
    ((x) == Func_Evnpt)                         ||                              \
    ((x) == Func_Eventout)                      ||                              \
    (((x) >= Func_Usart1_Tx)                    &&                              \
    ((x) <= Func_I2s2_Ck)))

/*! Parameter validity check for pin sub-function */
#define IS_VALID_SUBFUNC(x)                                                     \
(   ((x) == Func_Gpio)                          ||                              \
    ((x) == Func_Fcmref)                        ||                              \
    ((x) == Func_Rtcout)                        ||                              \
    ((x) == Func_Vcout)                         ||                              \
    ((x) == Func_Adtrg)                         ||                              \
    ((x) == Func_Mclkout)                       ||                              \
    ((x) == Func_Tim4)                          ||                              \
    ((x) == Func_Tim6)                          ||                              \
    ((x) == Func_Tima0)                         ||                              \
    ((x) == Func_Tima1)                         ||                              \
    ((x) == Func_Tima2)                         ||                              \
    ((x) == Func_Emb)                           ||                              \
    ((x) == Func_Usart_Ck)                      ||                              \
    ((x) == Func_Spi_Nss)                       ||                              \
    ((x) == Func_Qspi)                          ||                              \
    ((x) == Func_Key)                           ||                              \
    ((x) == Func_Sdio)                          ||                              \
    ((x) == Func_I2s)                           ||                              \
    ((x) == Func_UsbF)                          ||                              \
    ((x) == Func_Evnpt)                         ||                              \
    ((x) == Func_Eventout))

